package com.zinminthet.plantguardai.bootstrap;


import com.zinminthet.plantguardai.entities.*;
import com.zinminthet.plantguardai.repositories.*;
import jakarta.transaction.Transactional;
import lombok.RequiredArgsConstructor;
import org.springframework.boot.CommandLineRunner;
import org.springframework.security.crypto.password.PasswordEncoder;
import org.springframework.stereotype.Component;

import java.util.Arrays;
import java.util.List;
import java.util.Objects;

@Component
@RequiredArgsConstructor
public class DataInitialization implements CommandLineRunner {

    private final MerchantRepository merchantRepository;
    private final FarmerRepository farmerRepository;
    private final ShopRepository shopRepository;
    private final RoleRepository roleRepository;
    private final AuthRepository authRepository;
    private final AdminRepository adminRepository;
    private final PasswordEncoder passwordEncoder;
    private final DiseaseRepository diseaseRepository;
    private final CureRepository cureRepository;
    private final PesticideRepository pesticideRepository;


    @Transactional
    @Override
    public void run(String... args) throws Exception {
        populateRole(List.of("admin", "farmer", "merchant"));
        populateFarmer("Test", "test@gmail.com", "test", "64th street");
//        populateMerchant("Nara Kyaw Swar", "9/khamasa(N)/123123", "nrks@gmail.com", "nrks", List.of("Nara Limited", "Nara Family"));
//        populateAdmin("Zin Min Thet", "zinminthet.software.engineer@gmail.com", "admin");



        populateDiseases(Arrays.asList("စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ", "စပါးရွက်ညိုရွက်ပြောက်ရောဂါ", "စပါးရွက်လောင်ရောဂါ", "စပါးခေါက်ရောဂါ", "စပါးရွက်ခြောက်ရောဂါ", "Healthy"));


//        populateDisease("စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","လင်းနစ် ၂၀ ဒဗလျူပီ","စပါးနှင့် သီးနှံမျိုးစုံတွင် ကျရောက်သော ဘတ်တီးရီးယားရောဂါ အမျိုးမျိုးကို ကာကွယ်ကုသနိုင်သော ဘတ်တီးရီးယားရောဂါသတ်ဆေးဖြစ်သည်။",4500.00,"Oxolinic Acid 20%", "pesticides/လင်းနစ် ၂၀ ဒဗလျူပီ.jpg","မျိုးစေ့ဆောင်ရောဂါဖြစ်သည့်အတွက် ရောဂါကင်းသော ခံနိုင်ရည်ရှိသော မျိုးကောင်းမျိုးသန့်များကို စိုက်ပျိုးပါ။,ရောဂါဖြစ်စေသော သက်ရှိ ခိုအောင်းနိုင်သော လက်ခံပင်များကို ရှင်းလင်းပစ်ပါ။,စိုက်ပျိုးကတည်းက မြေပြင်ကို မြေဆီလုံလောက်စွာ ပြုပြင်၍ စိုက်ပျိုးပါ။","250g");
//        populateDisease("စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","လင်းနစ် ၂၀ ဒဗလျူပီ","စပါးနှင့် သီးနှံမျိုးစုံတွင် ကျရောက်သော ဘတ်တီးရီးယားရောဂါ အမျိုးမျိုးကို ကာကွယ်ကုသနိုင်သော ဘတ်တီးရီးယားရောဂါသတ်ဆေးဖြစ်သည်။",4500.00,"Oxolinic Acid 20%", "pesticides/လင်းနစ် ၂၀ ဒဗလျူပီ.jpg","မျိုးစေ့ဆောင်ရောဂါဖြစ်သည့်အတွက် ရောဂါကင်းသော ခံနိုင်ရည်ရှိသော မျိုးကောင်းမျိုးသန့်များကို စိုက်ပျိုးပါ။,ရောဂါဖြစ်စေသော သက်ရှိ ခိုအောင်းနိုင်သော လက်ခံပင်များကို ရှင်းလင်းပစ်ပါ။,စိုက်ပျိုးကတည်းက မြေပြင်ကို မြေဆီလုံလောက်စွာ ပြုပြင်၍ စိုက်ပျိုးပါ။","250g");
////        populateDisease("စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","ဖာတီဇို ၂၀ ဒဗလ်ဴပီ","စပါးတြင္က်ေရာက္ေသာဘက္တီးရီယား႐ြက္ေျခာက္ေရာဂါ၊ဘက္တီးရီးယား႐ြက္စင္းေရာဂါ၊ဟင္းသီးဟင္း႐ြက္တို႔တြင္က်ေရာက္ေသာ ဘက္တီးရီးယားအေပ်ာ့ပုပ္ေရာဂါ၊ ေရွာက္/သံပရာတို႔တြင္က်ေရာက္ေသာ ကင္ကာေရာဂါ၊ပဲအမ်ိဳးမ်ိဳးတြင္က်ေရာက္ေသာဘက္တီးရီးယား႐ြက္ေျခာက္ေရာဂါ၊ဝါသီးႏွံတြင္က်ေရာက္ေသာေထာင့္ကြက္လက္မဲေရာဂါတို႔ကိုကာကြယ္ႏွိမ္နင္းႏိုင္ေသာေဆးစြမ္းေကာင္းတလက္ျဖစ္ပါသည္။",4500.00,"Ferti-Xo 20% WP", "pesticides/ဖာတီဇို ၂၀ ဒဗလ်ဴပီ.jpg","မျိုးစေ့ဆောင်ရောဂါဖြစ်သည့်အတွက် ရောဂါကင်းသော ခံနိုင်ရည်ရှိသော မျိုးကောင်းမျိုးသန့်များကို စိုက်ပျိုးပါ။,ရောဂါဖြစ်စေသော သက်ရှိ ခိုအောင်းနိုင်သော လက်ခံပင်များကို ရှင်းလင်းပစ်ပါ။,စိုက်ပျိုးကတည်းက မြေပြင်ကို မြေဆီလုံလောက်စွာ ပြုပြင်၍ စိုက်ပျိုးပါ။","250g");


        scanDataPopulate();


    }


    public void scanDataPopulate(){
        populateDisease("စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","လင်းနစ် ၂၀ ဒဗလျူပီ","စပါးနှင့် သီးနှံမျိုးစုံတွင် ကျရောက်သော ဘတ်တီးရီးယားရောဂါ အမျိုးမျိုးကို ကာကွယ်ကုသနိုင်သော ဘတ်တီးရီးယားရောဂါသတ်ဆေးဖြစ်သည်။",4500.00,"Oxolinic Acid 20%", "pesticides/လင်းနစ် ၂၀ ဒဗလျူပီ.jpg","မျိုးစေ့ဆောင်ရောဂါဖြစ်သည့်အတွက် ရောဂါကင်းသော ခံနိုင်ရည်ရှိသော မျိုးကောင်းမျိုးသန့်များကို စိုက်ပျိုးပါ။,ရောဂါဖြစ်စေသော သက်ရှိ ခိုအောင်းနိုင်သော လက်ခံပင်များကို ရှင်းလင်းပစ်ပါ။,စိုက်ပျိုးကတည်းက မြေပြင်ကို မြေဆီလုံလောက်စွာ ပြုပြင်၍ စိုက်ပျိုးပါ။","250g");
        populateDisease("စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","ဖာတီဇို ၂၀ ဒဗလ်ဴပီ","စပါးတြင္က်ေရာက္ေသာဘက္တီးရီယား႐ြက္ေျခာက္ေရာဂါ၊ဘက္တီးရီးယား႐ြက္စင္းေရာဂါ၊ဟင္းသီးဟင္း႐ြက္တို႔တြင္က်ေရာက္ေသာ ဘက္တီးရီးယားအေပ်ာ့ပုပ္ေရာဂါ၊ ေရွာက္/သံပရာတို႔တြင္က်ေရာက္ေသာ ကင္ကာေရာဂါ၊ပဲအမ်ိဳးမ်ိဳးတြင္က်ေရာက္ေသာဘက္တီးရီးယား႐ြက္ေျခာက္ေရာဂါ၊ဝါသီးႏွံတြင္က်ေရာက္ေသာေထာင့္ကြက္လက္မဲေရာဂါတို႔ကိုကာကြယ္ႏွိမ္နင္းႏိုင္ေသာေဆးစြမ္းေကာင္းတလက္ျဖစ္ပါသည္။",4500.00,"Ferti-Xo 20% WP", "pesticides/ဖာတီဇို ၂၀ ဒဗလ်ဴပီ.jpg","မျိုးစေ့ဆောင်ရောဂါဖြစ်သည့်အတွက် ရောဂါကင်းသော ခံနိုင်ရည်ရှိသော မျိုးကောင်းမျိုးသန့်များကို စိုက်ပျိုးပါ။,ရောဂါဖြစ်စေသော သက်ရှိ ခိုအောင်းနိုင်သော လက်ခံပင်များကို ရှင်းလင်းပစ်ပါ။,စိုက်ပျိုးကတည်းက မြေပြင်ကို မြေဆီလုံလောက်စွာ ပြုပြင်၍ စိုက်ပျိုးပါ။","250g");
        populateDisease("စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","မက်ဂါဖန်ဇို","မှိုရောဂါအများစုအတွက် ထိရောက်သော ကာကွယ်ကုသဆေးဖြစ်သည်။ဆေးသည် ပင်လုံးပြန့်အာနိသင်ရှိပြီး မှိုစပိုးမျိုးညှောင့်ပေါက်မှုကို တားဆီးဟန့်တားပေးနိုင်သည့်အတွက် ရောဂါကျရောက်မှုမှ ကာကွယ်ပေးပါသည်။ထို့အပြင် မှိုမျှင်ကြီးထွားပွားများမှုကိုပါ ရပ်တန့်ပေးသည့်အတွက် ရောဂါပြန့်ပွားမှုကို ကုသနှိမ်နင်းပေးနိုင်ပါသည်။",5000.00,"Azoxystrobin 25% ,Difenoconazole 15% WDG","pesticides/Mega Fenzo.png","မျိုးစေ့ဆောင်ရောဂါဖြစ်သည့်အတွက် ရောဂါကင်းသော ခံနိုင်ရည်ရှိသော မျိုးကောင်းမျိုးသန့်များကို စိုက်ပျိုးပါ။,ရောဂါဖြစ်စေသော သက်ရှိ ခိုအောင်းနိုင်သော လက်ခံပင်များကို ရှင်းလင်းပစ်ပါ။,စိုက်ပျိုးကတည်းက မြေပြင်ကို မြေဆီလုံလောက်စွာ ပြုပြင်၍ စိုက်ပျိုးပါ။","250g");
        populateDisease("စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","မက်ဂါ ကော့ပါး","ထိသေအာနိသင်ရှိ မှိုနှင့် ဘက်တီးရီးယားရောဂါ ကာကွယ်ဆေးဖြစ်သည်။မှိုမျှင်နှင့် ဘက်တီးရီးယားများ၏ ရှင်သန်ပွားများမှုကို နှောင့်ယှက်ဟန့်တားပေးပါသည်။သီးနှံကို ဆေးကြိုတင်ဖျန်းထားပါက အပင်ပေါ်ရှိ မှိုစပိုးမျိုးညှောင့်ပေါက်မှုကို ကာကွယ်ပေးပါသည်။",6000.00,"Copper hydroxide 77% WP","pesticides/Mega Copper.png","မျိုးစေ့ဆောင်ရောဂါဖြစ်သည့်အတွက် ရောဂါကင်းသော ခံနိုင်ရည်ရှိသော မျိုးကောင်းမျိုးသန့်များကို စိုက်ပျိုးပါ။,ရောဂါဖြစ်စေသော သက်ရှိ ခိုအောင်းနိုင်သော လက်ခံပင်များကို ရှင်းလင်းပစ်ပါ။,စိုက်ပျိုးကတည်းက မြေပြင်ကို မြေဆီလုံလောက်စွာ ပြုပြင်၍ စိုက်ပျိုးပါ။","100g");
        populateDisease("စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","မက်ဂါ ဘစ်ရှော့","ထိသေနှင့် ပင်လုံးပျံ့အာနိသင်ရှိ အစွမ်းထက်မှိုသတ်ဆေးဖြစ်သည်။သီးနှံပင်၏ အရွက်နှင့် အမြစ်နှစ်မျိုးလုံးမှ စုပ်ယူပြီး အပင်၏ ရေကြောစည်းအတွင်း အောက်မှ အထက်သို့ ပျံ့နှံ့စေပါသည်။မှိုမျှင်ကြီးထွားမှုနှင့် မှိုစပိုးမျိုးညှောင့်ပေါက်မှုကို ဟန့်တားပေးပါသည်။",5000.00,"Thiophanate-Methyl 50%, Thiram 30% WP","pesticides/Mega Bishop.png","မျိုးစေ့ဆောင်ရောဂါဖြစ်သည့်အတွက် ရောဂါကင်းသော ခံနိုင်ရည်ရှိသော မျိုးကောင်းမျိုးသန့်များကို စိုက်ပျိုးပါ။,ရောဂါဖြစ်စေသော သက်ရှိ ခိုအောင်းနိုင်သော လက်ခံပင်များကို ရှင်းလင်းပစ်ပါ။,စိုက်ပျိုးကတည်းက မြေပြင်ကို မြေဆီလုံလောက်စွာ ပြုပြင်၍ စိုက်ပျိုးပါ။","150g");
        populateDisease("စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","မက်ဂါဘေးရှင်း","ပင်လုံးပြန့်အာနိသင်ရှိ ကာကွယ်၊ ကုသနိုင်သော ဘက်တီးရီးယားနှင့် မှိုသတ်ဆေးဖြစ်သည်။ဘက်တီးရီးယားဆဲလ်ကွဲပွားများမှုနှင့် ပျံ့ပွားမှုများကို ဟန့်တားပေးနိုင်သည်။ဆေးသည် စပါးပင်၏ ပိုးမွှားမျိုးစုံအတွက်ခံနိုင်ရည်ရှိမှုကိုလည်း လှုံ့ဆော်ပေးနိုင်ပါသည်။",5000.00,"Bismerthiazol 20% WP","pesticides/Mega Bay Shin.png","မျိုးစေ့ဆောင်ရောဂါဖြစ်သည့်အတွက် ရောဂါကင်းသော ခံနိုင်ရည်ရှိသော မျိုးကောင်းမျိုးသန့်များကို စိုက်ပျိုးပါ။,ရောဂါဖြစ်စေသော သက်ရှိ ခိုအောင်းနိုင်သော လက်ခံပင်များကို ရှင်းလင်းပစ်ပါ။,စိုက်ပျိုးကတည်းက မြေပြင်ကို မြေဆီလုံလောက်စွာ ပြုပြင်၍ စိုက်ပျိုးပါ။","150g");
        populateDisease("စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","ရွှေကော့ပါး","ထိသေအာနိသင်ရှိ မှိုနှင့် ဘက်တီးရီးယားရောဂါ ကာကွယ်ဆေးဖြစ်သည်။မှိုမျှင်နှင့် ဘက်တီးရီးယားများ၏ ရှင်သန်ပွားများမှုကို နှောင့်ယှက်ဟန့်တားပေးပါသည်။သီးနှံကို ဆေးကြိုတင်ဖျန်းထားပါက အပင်ပေါ်ရှိ မှိုစပိုးမျိုးညှောင့်ပေါက်မှုကို ကာကွယ်ပေးပါသည်။",5000.00,"Copper-hydroxide 77% WP","pesticides/Golden Copper.png","မျိုးစေ့ဆောင်ရောဂါဖြစ်သည့်အတွက် ရောဂါကင်းသော ခံနိုင်ရည်ရှိသော မျိုးကောင်းမျိုးသန့်များကို စိုက်ပျိုးပါ။,ရောဂါဖြစ်စေသော သက်ရှိ ခိုအောင်းနိုင်သော လက်ခံပင်များကို ရှင်းလင်းပစ်ပါ။,စိုက်ပျိုးကတည်းက မြေပြင်ကို မြေဆီလုံလောက်စွာ ပြုပြင်၍ စိုက်ပျိုးပါ။","150g");

        populateDisease("စပါးရွက်ညိုရွက်ပြောက်ရောဂါ","ဘတ်တီးရီးယား","ဇိုလာ ၂၅ အီးစီ","သီးနှံအမျိုးမျိုးတွင် ကျရောက်ဖျက်ဆီးသည့် မှိုရောဂါများကို ကာကွယ်ကုသသောပင်လုံးပြန့် အာနိသင်ရှိ မှိုသတ်ဆေးဖြစ်သည်။",5000.99,"Difenoconazole 25%","pesticides/ဇိုလာ ၂၅ အီးစီ.jpg","စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ ကာကွယ်ရန်အကောင်းဆုံးနည်းမှာ ရောဂါခံနိုင်ရည်ရှိသော စပါးမျိုးများ စိုက်ပျိုးခြင်းဖြစ်သည်။,နိုက်တြိုဂျင်ဓါတ်မြေသြဇာ လျော့သုံးရမည်ဖြစ်ပြီး ပိုတက်မြေသြဇာကို များများသုံးပေးရန်။,BLBရောဂါကျရောက်လျင် Kasugamycin နှင့် Copper ပါဝင်သောမှိုသတ်ဆေးများအသုံးပြုပတ်ဖြန်းပါ။","250g");
        populateDisease("စပါးရွက်ညိုရွက်ပြောက်ရောဂါ","ဘတ်တီးရီးယား","ဘင်ဇိုကာ၅၅၀ အက်စ်စီ","အာလူး၊ ခရမ်းချဉ်၊ ဟင်းသီးဟင်းရွက်နှင့် စပါးတို့တွင် ကျရောက်သည့်မှိုရောဂါများကို ထိရောက်စွာ ကာကွယ်နှိမ်နင်းပေးနိုင်သော မှိုသတ်ဆေးရည် ဖြစ်သည်။",6000.99,"Chlorothalonil 45%,Hexaconazole 3.5%,Cymoxanil 6.5%","pesticides/ဘင်ဇိုကာ၅၅၀ အက်စ်စီ.jpg","စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ ကာကွယ်ရန်အကောင်းဆုံးနည်းမှာ ရောဂါခံနိုင်ရည်ရှိသော စပါးမျိုးများ စိုက်ပျိုးခြင်းဖြစ်သည်။,နိုက်တြိုဂျင်ဓါတ်မြေသြဇာ လျော့သုံးရမည်ဖြစ်ပြီး ပိုတက်မြေသြဇာကို များများသုံးပေးရန်။,BLBရောဂါကျရောက်လျင် Kasugamycin နှင့် Copper ပါဝင်သောမှိုသတ်ဆေးများအသုံးပြုပတ်ဖြန်းပါ။","250g");
        populateDisease("စပါးရွက်ညိုရွက်ပြောက်ရောဂါ","ဘတ်တီးရီးယား","နိုက်စ် ၅၂၅ အက်စ်အီး","စပါးဂုတ်ကျိုးနှင့်မှိုရောဂါအမျိုးမျိုးကို ကာကွယ်ကုသနိုင်သော မှိုသတ်ဆေးရည်ဖြစ်သည်။အဓိကနှိမ်နင်းနိုင်သောရောဂါ- စပါးဂုတ်ကျိုးရောဂါ၊ရွက်ညိုပြောက်၊ ရွက်ဖုံးခြောက်၊စပါးမှိုုသီးရောဂါ။",5000.00,"Propiconazole 12.5% , Tricyclazole 40%","pesticides/နိုက်စ် ၅၂၅ အက်စ်အီး.jpg","စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ ကာကွယ်ရန်အကောင်းဆုံးနည်းမှာ ရောဂါခံနိုင်ရည်ရှိသော စပါးမျိုးများ စိုက်ပျိုးခြင်းဖြစ်သည်။,နိုက်တြိုဂျင်ဓါတ်မြေသြဇာ လျော့သုံးရမည်ဖြစ်ပြီး ပိုတက်မြေသြဇာကို များများသုံးပေးရန်။,BLBရောဂါကျရောက်လျင် Kasugamycin နှင့် Copper ပါဝင်သောမှိုသတ်ဆေးများအသုံးပြုပတ်ဖြန်းပါ။","200g");
        populateDisease("စပါးရွက်ညိုရွက်ပြောက်ရောဂါ","ဘတ်တီးရီးယား","ဆိုင်မို-ဇက် ၇၂ ဒဗလျူပီ","မှိုသတ်ဆေးနှစ်မျိုးကို ပေါင်းစပ်ထား၍ သီးနှံရောဂါအမျိုးမျိုးကို ကာကွယ်ကုသနိုင်သော မှိုရောဂါသတ်ဆေးဖြစ်သည်။",5000.00,"Cymoxanil 8% + Mancozeb 64%","pesticides/ဆိုင်မို-ဇက် ၇၂ ဒဗလျူပီ.jpg","စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ ကာကွယ်ရန်အကောင်းဆုံးနည်းမှာ ရောဂါခံနိုင်ရည်ရှိသော စပါးမျိုးများ စိုက်ပျိုးခြင်းဖြစ်သည်။,နိုက်တြိုဂျင်ဓါတ်မြေသြဇာ လျော့သုံးရမည်ဖြစ်ပြီး ပိုတက်မြေသြဇာကို များများသုံးပေးရန်။,BLBရောဂါကျရောက်လျင် Kasugamycin နှင့် Copper ပါဝင်သောမှိုသတ်ဆေးများအသုံးပြုပတ်ဖြန်းပါ။","200g");
        populateDisease("စပါးရွက်ညိုရွက်ပြောက်ရောဂါ","ဘတ်တီးရီးယား","သာလွန် ၇၂ အက်စ်စီ","ဒေါင်းနီးရွက်ခြောက်ရောဂါ၊ မှဲ့ပြောက်စွန်း ရောဂါ၊ ရွက်ပြောက်ရောဂါများ၊ ရွက်ညိုပြောက်ရောဂါ၊ သီးပုပ်ရောဂါ၊ သံချေး ရောဂါ၊ ဖားဥမှိုရောဂါနှင့် ကြက်သွန်တောက်တဲ့့မြီးရောဂါ စသည့် ရောဂါများအား ထိရောက်စွာ ကာကွယ်ကုသပေးနိုင်သည့် ပင်လုံးပြန့်အာနိသင်ရှိသော မှိုသတ်ဆေးရည်ဖြစ်ပါသည်။",5000.00,"Chlorothalonil 72%","pesticides/သာလွန် ၇၂ အက်စ်စီ.jpg","စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ ကာကွယ်ရန်အကောင်းဆုံးနည်းမှာ ရောဂါခံနိုင်ရည်ရှိသော စပါးမျိုးများ စိုက်ပျိုးခြင်းဖြစ်သည်။,နိုက်တြိုဂျင်ဓါတ်မြေသြဇာ လျော့သုံးရမည်ဖြစ်ပြီး ပိုတက်မြေသြဇာကို များများသုံးပေးရန်။,BLBရောဂါကျရောက်လျင် Kasugamycin နှင့် Copper ပါဝင်သောမှိုသတ်ဆေးများအသုံးပြုပတ်ဖြန်းပါ။","200g");
        populateDisease("စပါးရွက်ညိုရွက်ပြောက်ရောဂါ","ဘတ်တီးရီးယား","ဇီဖလို","သီးနှံအရွက်မျက်နှာပြင်ပေါ်တွင် ဆေးပြန့်နှံ့မှုကောင်းမွန်ပြီး ရောဂါကိုထိရောက်စွာကာကွယ်နိုင်သည်။",5000.00,"Ziram 76%","pesticides/ဇီဖလို.jpg","စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ ကာကွယ်ရန်အကောင်းဆုံးနည်းမှာ ရောဂါခံနိုင်ရည်ရှိသော စပါးမျိုးများ စိုက်ပျိုးခြင်းဖြစ်သည်။,နိုက်တြိုဂျင်ဓါတ်မြေသြဇာ လျော့သုံးရမည်ဖြစ်ပြီး ပိုတက်မြေသြဇာကို များများသုံးပေးရန်။,BLBရောဂါကျရောက်လျင် Kasugamycin နှင့် Copper ပါဝင်သောမှိုသတ်ဆေးများအသုံးပြုပတ်ဖြန်းပါ။","200g");


        populateDisease("စပါးရွက်လောင်ရောဂါ","ဘတ်တီးရီးယား","ကျူပရို-မိုင်စင် ၄၇၀ ဒဗလျူပီ","ထိသေနှင့်ပင်လုံးပြန့်အာနိသင်ရှိ ဘက်တီးရီးယားနှင့် မှိုရောဂါ ကာကွယ်ကုသဆေးဖြစ်သည်။ ",4999.99,"Copper oxychloride 45 % ,Kasugamycin 2 %","pesticides/ကျူပရို-မိုင်စင် ၄၇၀ ဒဗလျူပီ.jpg","ရောဂါကင်းစင်သောမျိုးစေ့ကို အသုံးပြုပါ။ နိုက်ထရိုဂျင်ဓာတ်မြေဩဇာ (ယူရီးယား) အလွန်အကျွံသုံးခြင်းကို ရှောင်ကြဉ်ပါ။ စိုက်သိပ်သည်းဆ လျှော့ချပါ။,ရောဂါရ အပင်ဟောင်းများကို ဖျက်ဆီးပါ။, လိုအပ်ပါက မှိုသတ်ဆေးများ (ဥပမာ- Hexaconazole, Validamycin) ကို လမ်းညွှန်ချက်အတိုင်း အသုံးပြုပါ။ ","250g");
        populateDisease("စပါးရွက်လောင်ရောဂါ","ဘတ်တီးရီးယား","M-Pro 25% EC","စပါး၊ ပြောင်း၊ ကြံ၊ နှံစားသီးနှံများ၊ ပဲမျိုးစုံ၊ ပန်းသီး၊ စပျစ်၊ ကော်ဖီ၊ သရက်၊ ငှက်ပျောစသည့် သီးနှံများ၊ ခရမ်းချဉ်၊ အာလူး၊ ဘူး၊ ဖရုံ၊ သခွားနှင့် ဟင်းသီးဟင်းရွက်များတွင် ကျရောက်တတ်သည့် မှိုရောဂါအမျိုးမျိုးတို့ကို ကာကွယ်ကုသရန်နှင့် မျိူးစေ့စိမ်ရန်အတွက် အသုံးပြုနိုင်သည်။",7000.00,"Cypermethrin 25%","pesticides/M-Pro 25% EC.jpg","ရောဂါကင်းစင်သောမျိုးစေ့ကို အသုံးပြုပါ။ နိုက်ထရိုဂျင်ဓာတ်မြေဩဇာ (ယူရီးယား) အလွန်အကျွံသုံးခြင်းကို ရှောင်ကြဉ်ပါ။ စိုက်သိပ်သည်းဆ လျှော့ချပါ။,ရောဂါရ အပင်ဟောင်းများကို ဖျက်ဆီးပါ။, လိုအပ်ပါက မှိုသတ်ဆေးများ (ဥပမာ- Hexaconazole, Validamycin) ကို လမ်းညွှန်ချက်အတိုင်း အသုံးပြုပါ။ ","100g");
        populateDisease("စပါးရွက်လောင်ရောဂါ","ဘတ်တီးရီးယား","ထရိုင်းဒန့်","ကာကွယ်ခြင်း ကုသခြင်း အာနိသင်၂မျိုးလုံးရနိုင်သည်။စပါးဂုတ်ကျိုးရောဂါအတွက် သီးသန့်ဆေးဖြစ်ရုံသာမက အပင်စိမ်းလန်းသာမာစေပြီး ရောဂါကြီးထွားမှုကိုပါ ရပ်တန့်စေပါသည်။ စပါးအရည်အသွေးပိုမိုကောင်းမွန်စေမည်ဖြစ်ပါသည်။",7000.00,"Tricyclazole 40%","pesticides/ထရိုင်းဒန့်.jpg","ရောဂါကင်းစင်သောမျိုးစေ့ကို အသုံးပြုပါ။ နိုက်ထရိုဂျင်ဓာတ်မြေဩဇာ (ယူရီးယား) အလွန်အကျွံသုံးခြင်းကို ရှောင်ကြဉ်ပါ။ စိုက်သိပ်သည်းဆ လျှော့ချပါ။,ရောဂါရ အပင်ဟောင်းများကို ဖျက်ဆီးပါ။, လိုအပ်ပါက မှိုသတ်ဆေးများ (ဥပမာ- Hexaconazole, Validamycin) ကို လမ်းညွှန်ချက်အတိုင်း အသုံးပြုပါ။ ","100g");
        populateDisease("စပါးရွက်လောင်ရောဂါ","ဘတ်တီးရီးယား","ဩဘာစပါးမှိုဆေး","မှိုရောဂါကာကွယ်ကုသမှုအပြင် အမြစ်ပြတ်သုတ်သင်နိုင်ပြီး ရွက်လွှာကြားစိမ့်ဝင်မှု နှင့် ပင်လုံးပြန့်အာနိသင်ရှိ မှိုသတ်ဆေးတစ်မျိုးဖြစ်သည်။စပါးပင်၏အရွက်မှစုပ်ယူရုံသာမက အမြစ်မှလဲစုပ်ယူနိုင်သည့် အစွမ်းထက်မှိုသတ်ဆေးဖြစ်၍ သီးနှံပင်စိမ်းစိုစေပြီး စပါးအရည်အသွေးကို ပိုမိုကောင်းမွန်စေသည်။",7000.00,"Tricyclazole 40% ,Propiconazole12.5%","pesticides/ဩဘာစပါးမှိုဆေး.jpg","ရောဂါကင်းစင်သောမျိုးစေ့ကို အသုံးပြုပါ။ နိုက်ထရိုဂျင်ဓာတ်မြေဩဇာ (ယူရီးယား) အလွန်အကျွံသုံးခြင်းကို ရှောင်ကြဉ်ပါ။ စိုက်သိပ်သည်းဆ လျှော့ချပါ။,ရောဂါရ အပင်ဟောင်းများကို ဖျက်ဆီးပါ။, လိုအပ်ပါက မှိုသတ်ဆေးများ (ဥပမာ- Hexaconazole, Validamycin) ကို လမ်းညွှန်ချက်အတိုင်း အသုံးပြုပါ။ ","100g");
        populateDisease("စပါးရွက်လောင်ရောဂါ","ဘတ်တီးရီးယား","ဟေဗင်","ပင်လုံးပြန့် အာနိသင်ရှိပြီး အပင်ကိုဖျက်ဆီးသောမှိုများ၏ဆဲလ် နံရံတည်ဆောက်မှုကိုတားဆီးပေးသောဆေးဖြစ်သည်။",7000.00,"Hexaconazole 5%","pesticides/ဟေဗင်.jpg","ရောဂါကင်းစင်သောမျိုးစေ့ကို အသုံးပြုပါ။ နိုက်ထရိုဂျင်ဓာတ်မြေဩဇာ (ယူရီးယား) အလွန်အကျွံသုံးခြင်းကို ရှောင်ကြဉ်ပါ။ စိုက်သိပ်သည်းဆ လျှော့ချပါ။,ရောဂါရ အပင်ဟောင်းများကို ဖျက်ဆီးပါ။, လိုအပ်ပါက မှိုသတ်ဆေးများ (ဥပမာ- Hexaconazole, Validamycin) ကို လမ်းညွှန်ချက်အတိုင်း အသုံးပြုပါ။ ","100g");
        populateDisease("စပါးရွက်လောင်ရောဂါ","ဘတ်တီးရီးယား","ရီဗိုက်","ပင်လုံးပြန့်အာနိသင်နှင့် ထိုးဖောက်စိမ့်ဝင်နိုင်သောအာနိသင်ရှိသည်။အီလက်ထရွန်သွားလာမှုလမ်းကြောင်းအားအဆင့်ဆင့်ပြိုကွဲပျက်စီးစေပြီး မှိုမျှင်များ၏ အသက်ရှူစနစ်ကို တားစီးပိတ်ပင်ပါသည်။အပင်ရေကြောစီးမှပြန့်နှံ့သည်။",7000.00,"Azoxystrobin 25%","pesticides/Revive.jpg","ရောဂါကင်းစင်သောမျိုးစေ့ကို အသုံးပြုပါ။ နိုက်ထရိုဂျင်ဓာတ်မြေဩဇာ (ယူရီးယား) အလွန်အကျွံသုံးခြင်းကို ရှောင်ကြဉ်ပါ။ စိုက်သိပ်သည်းဆ လျှော့ချပါ။,ရောဂါရ အပင်ဟောင်းများကို ဖျက်ဆီးပါ။, လိုအပ်ပါက မှိုသတ်ဆေးများ (ဥပမာ- Hexaconazole, Validamycin) ကို လမ်းညွှန်ချက်အတိုင်း အသုံးပြုပါ။ ","100g");


        populateDisease("စပါးခေါက်ရောဂါ","ဘတ်တီးရီးယား","MLM Mancozeb 80% WP","ဖရဲမျိုးများတွင် ကျရောက်တတ်သည့် မှဲ့ပြောက်စွန်းရောဂါ၊ စပါးဂုတ်ကျိုးရောဂါ၊ ပဲမျိုးစုံ၊ ငရုတ်၊ အာလူး၊ ခရမ်းချဉ်၊ ကြက်သွန်ဖြူ/နီ၊ ကွမ်းမြေပဲနှင့် သစ်သီး၀လံ၊ ပန်းမန်များတွင် ကျရောက်တတ်သည့် မှိုရောဂါအမျိုးမျိုး ကာကွယ် နှိမ်နှင်းပေးနိုင်သည်။",7888.99,"Mancozeb 80%","pesticides/MLM Mancozeb 80% WP.jpg","စပါးရွက်လိပ်/ရွက်ခေါက်ပိုးခံနိုင်ရည်ရှိတဲ့ စပါးမျိုးများကို စိုက်ပျိုးပါ။,စပါးရိတ်သိမ်းပြီးတဲ့နောက်မှာ စပါးခင်းကို ရေလွှမ်းပြီး ထယ်ထိုးပါ။,စပါးခင်းနဲ့ ကန်သင်းပေါ်က မြက်မျိုးနွယ်ဝင်ပေါင်းတွေကို ဖယ်ရှားပါ။,စပါးနဲ့မတူတဲ့ အခြားသီးနှံတွေနဲ့ သီးလှည့်စိုက်ပါ ဒါမှမဟုတ် ဘာမှမစိုက်ဘဲထားတဲ့ကာလ ကြာရှည်ပါစေ။,လမိုင်းထားခြင်းကို ရှောင်ရှားပါ။","260g");
        populateDisease("စပါးခေါက်ရောဂါ","ဘတ်တီးရီးယား","မက်ဂါ ခရူဇာ","မှိုသတ်ဆေးဖြစ်သည့်အပြင် အပင်ဟော်မုန်းအာနိသင်ပါ ရှိပြီး သီးနှံမျိုးစုံတွင် ကျရောက်သော မှိုရောဂါမျိုးစုံကို နှိမ်နင်းပေးနိုင်ပါသည်။၊ပင်လုံးပြန့်အာနိသင်ရှိပြီး မှိုမျှင်၊ မှိုစပိုးများ၏ အသက်ရှူမှုနှင့် အောက်ဆီဂျင် ရရှိမှုကို နှောင့်ယှက်ဖျက်ဆီးပေးပါသည်။",4000.00,"Tebuconazole 50 % , Trifloxystrobin 25 % WDG","pesticides/Mega Cruiser.png","စပါးရွက်လိပ်/ရွက်ခေါက်ပိုးခံနိုင်ရည်ရှိတဲ့ စပါးမျိုးများကို စိုက်ပျိုးပါ။,စပါးရိတ်သိမ်းပြီးတဲ့နောက်မှာ စပါးခင်းကို ရေလွှမ်းပြီး ထယ်ထိုးပါ။,စပါးခင်းနဲ့ ကန်သင်းပေါ်က မြက်မျိုးနွယ်ဝင်ပေါင်းတွေကို ဖယ်ရှားပါ။,စပါးနဲ့မတူတဲ့ အခြားသီးနှံတွေနဲ့ သီးလှည့်စိုက်ပါ ဒါမှမဟုတ် ဘာမှမစိုက်ဘဲထားတဲ့ကာလ ကြာရှည်ပါစေ။,လမိုင်းထားခြင်းကို ရှောင်ရှားပါ။","150g");
        populateDisease("စပါးခေါက်ရောဂါ","ဘတ်တီးရီးယား","Maxcin 2 SL","မှိုနှင့်ဘက်တီးရီးယားများကြောင့် ဖြစ်သောရောဂါများစွာကို ကာကွယ်ပေးနိုင်သော ဆေး ဖြစ်သည်။ သီးနှံပင်အတွင်းလျှင်မြန်စွာ ပျံ့နှံ့နိုင်ကာ မှိုနှင့်ဘက်တီးရီးယားများ၏ ပရိုတင်း ဖြစ်ပေါ်မှုကိုဟန့်တားပေးသဖြင့် ရောဂါဖြစ်ပွားစေခြင်းကို လျော့ကျစေပါသည်။ ",4000.00,"Maxcin 2 SL","pesticides/Maxcin 2 SL.jpg","စပါးရွက်လိပ်/ရွက်ခေါက်ပိုးခံနိုင်ရည်ရှိတဲ့ စပါးမျိုးများကို စိုက်ပျိုးပါ။,စပါးရိတ်သိမ်းပြီးတဲ့နောက်မှာ စပါးခင်းကို ရေလွှမ်းပြီး ထယ်ထိုးပါ။,စပါးခင်းနဲ့ ကန်သင်းပေါ်က မြက်မျိုးနွယ်ဝင်ပေါင်းတွေကို ဖယ်ရှားပါ။,စပါးနဲ့မတူတဲ့ အခြားသီးနှံတွေနဲ့ သီးလှည့်စိုက်ပါ ဒါမှမဟုတ် ဘာမှမစိုက်ဘဲထားတဲ့ကာလ ကြာရှည်ပါစေ။,လမိုင်းထားခြင်းကို ရှောင်ရှားပါ။","150g");
        populateDisease("စပါးခေါက်ရောဂါ","ဘတ်တီးရီးယား","ဇီဖလို","သီးနှံအရွက်မျက်နှာပြင်ပေါ်တွင် ဆေးပြန့်နှံ့မှုကောင်းမွန်ပြီး ရောဂါကိုထိရောက်စွာကာကွယ်နိုင်သည်။",4000.00,"Ziram 76%","pesticides/ဇီဖလို.jpg","စပါးရွက်လိပ်/ရွက်ခေါက်ပိုးခံနိုင်ရည်ရှိတဲ့ စပါးမျိုးများကို စိုက်ပျိုးပါ။,စပါးရိတ်သိမ်းပြီးတဲ့နောက်မှာ စပါးခင်းကို ရေလွှမ်းပြီး ထယ်ထိုးပါ။,စပါးခင်းနဲ့ ကန်သင်းပေါ်က မြက်မျိုးနွယ်ဝင်ပေါင်းတွေကို ဖယ်ရှားပါ။,စပါးနဲ့မတူတဲ့ အခြားသီးနှံတွေနဲ့ သီးလှည့်စိုက်ပါ ဒါမှမဟုတ် ဘာမှမစိုက်ဘဲထားတဲ့ကာလ ကြာရှည်ပါစေ။,လမိုင်းထားခြင်းကို ရှောင်ရှားပါ။","150g");
        populateDisease("စပါးခေါက်ရောဂါ","ဘတ်တီးရီးယား","ဩဘာစပါးမှိုဆေး","မှိုရောဂါကာကွယ်ကုသမှုအပြင် အမြစ်ပြတ်သုတ်သင်နိုင်ပြီး ရွက်လွှာကြားစိမ့်ဝင်မှု နှင့် ပင်လုံးပြန့်အာနိသင်ရှိ မှိုသတ်ဆေးတစ်မျိုးဖြစ်သည်။စပါးပင်၏အရွက်မှစုပ်ယူရုံသာမက အမြစ်မှလဲစုပ်ယူနိုင်သည့် အစွမ်းထက်မှိုသတ်ဆေးဖြစ်၍ သီးနှံပင်စိမ်းစိုစေပြီး စပါးအရည်အသွေးကို ပိုမိုကောင်းမွန်စေသည်။",4000.00,"Tricyclazole 40% ,Propiconazole12.5%","pesticides/ဩဘာစပါးမှိုဆေး.jpg","စပါးရွက်လိပ်/ရွက်ခေါက်ပိုးခံနိုင်ရည်ရှိတဲ့ စပါးမျိုးများကို စိုက်ပျိုးပါ။,စပါးရိတ်သိမ်းပြီးတဲ့နောက်မှာ စပါးခင်းကို ရေလွှမ်းပြီး ထယ်ထိုးပါ။,စပါးခင်းနဲ့ ကန်သင်းပေါ်က မြက်မျိုးနွယ်ဝင်ပေါင်းတွေကို ဖယ်ရှားပါ။,စပါးနဲ့မတူတဲ့ အခြားသီးနှံတွေနဲ့ သီးလှည့်စိုက်ပါ ဒါမှမဟုတ် ဘာမှမစိုက်ဘဲထားတဲ့ကာလ ကြာရှည်ပါစေ။,လမိုင်းထားခြင်းကို ရှောင်ရှားပါ။","150g");
        populateDisease("စပါးခေါက်ရောဂါ","ဘတ်တီးရီးယား","ဟေဗင်","ပင်လုံးပြန့် အာနိသင်ရှိပြီး အပင်ကိုဖျက်ဆီးသောမှိုများ၏ဆဲလ် နံရံတည်ဆောက်မှုကိုတားဆီးပေးသောဆေးဖြစ်သည်။",4000.00,"Hexaconazole 5%","pesticides/ဟေဗင်.jpg","စပါးရွက်လိပ်/ရွက်ခေါက်ပိုးခံနိုင်ရည်ရှိတဲ့ စပါးမျိုးများကို စိုက်ပျိုးပါ။,စပါးရိတ်သိမ်းပြီးတဲ့နောက်မှာ စပါးခင်းကို ရေလွှမ်းပြီး ထယ်ထိုးပါ။,စပါးခင်းနဲ့ ကန်သင်းပေါ်က မြက်မျိုးနွယ်ဝင်ပေါင်းတွေကို ဖယ်ရှားပါ။,စပါးနဲ့မတူတဲ့ အခြားသီးနှံတွေနဲ့ သီးလှည့်စိုက်ပါ ဒါမှမဟုတ် ဘာမှမစိုက်ဘဲထားတဲ့ကာလ ကြာရှည်ပါစေ။,လမိုင်းထားခြင်းကို ရှောင်ရှားပါ။","150g");

        populateDisease("စပါးရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","ကာစင် ၂ အက်စ်အယ်","ပင်လုံးပြန့်အာနိသင်ရှိ ကာကွယ်မှုနှင့် ကုသမှုပေးနိုင်သော မှိုနှင့်ဘက်တီးရီးယား ရောဂါသတ်ဆေးရည်ဖြစ်သည်။",788.00,"Kasugamycin 2%","pesticides/ကာစင် ၂ အက်စ်အယ်.jpg","ရောဂါကင်းစင်သော မျိုးစေ့ကို အသုံးပြုပါ။,စပါးပင်များ ကျပ်မနေစေရန် စိုက်ပျိုးစိပ်ခြင်းကို ရှောင်ကြဉ်ပါ။,ရောဂါလက္ခဏာများ စတင်တွေ့ရှိပါက ကော့ပါးအောက်စီကလိုရိုက် (Copper oxychloride) ကဲ့သို့သော ဘက်တီးရီးယားသတ်ဆေးများကို အသုံးပြုနိုင်သည်။","250g");
        populateDisease("စပါးရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","တြိုင်-ဂိုးလ် ဒဗလျူပီ","ရွက်ဖျန်းသဘာ၀မှိုသတ်ဆေးဖြစ်ပြီး စပါး၊ ပြောင်း၊ ပဲမျိုးစုံ၊ ကွမ်း၊ ခရမ်း၊ သရက်အစရှိသည့်အပင်များတွင် ကျရောက်တတ်သော ရွက်ဖုံးခြောက်၊ ပင်စည်ပုပ်၊ ရွက်ပြောက်၊ ဖားဥမှို၊ သံချေးအစရှိသည့် မှိုရောဂါအမျိုးမျိုးကို နှိမ်နှင်းရာတွင် အသုံးပြုနိုင်ပါသည်။",3000.00,"Hexaconazole 5%","pesticides/တြိုင်-ဂိုးလ် ဒဗလျူပီ.jpg","ရောဂါကင်းစင်သော မျိုးစေ့ကို အသုံးပြုပါ။,စပါးပင်များ ကျပ်မနေစေရန် စိုက်ပျိုးစိပ်ခြင်းကို ရှောင်ကြဉ်ပါ။,ရောဂါလက္ခဏာများ စတင်တွေ့ရှိပါက ကော့ပါးအောက်စီကလိုရိုက် (Copper oxychloride) ကဲ့သို့သော ဘက်တီးရီးယားသတ်ဆေးများကို အသုံးပြုနိုင်သည်။","120g");
        populateDisease("စပါးရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","M-Style 25%SC","စပါးတွင် ကျရောက်သော စပါးဂုတ်ကျိုးရောဂါ၊ ရွက်ဖုံးခြောက်ရောဂါ၊ ပင်စည်ပုပ်ရောဂါ၊ မတ်ပဲ၊ ပဲတီစိမ်းတွင် ကျရောက်သော သံချေးရောဂါ၊ အမြစ်ပုပ်ရောဂါ၊ ဖားဥမှိုရောဂါ၊ ဒေါင်းနီးရွက်ခြောက်ရောဂါ၊ ခရမ်းချဉ်နှင့် အာလူးတွင် ကျရောက်တက်သော စောပင်နာကျနှင့် နှောင်းပင်နာကျရောဂါ၊ ဖရဲ၊ သခွား၊ သခွားမွှေးနှင့် စပျစ်တို့တွင် ကျရောက်သော ဖားဥမှိုရောဂါ၊ မှဲ့ပြောက်စွန်းရောဂါ၊ သရက်၊ ဂန္ဓမာနှင့် ပန်းမန်များတွင် ကျရောက်သော သံချေးရောဂါအမျိုးမျိူးနှင့် ကြက်သွန်ဖြူ/နီတွင် ကျရောက်သော တောက်တဲ့မြီးရောဂါများကို နှိမ်နှင်းနိုင်သည်။",3000.00,"Hexaconazole 5%","pesticides/M-Style 25%SC.jpg","ရောဂါကင်းစင်သော မျိုးစေ့ကို အသုံးပြုပါ။,စပါးပင်များ ကျပ်မနေစေရန် စိုက်ပျိုးစိပ်ခြင်းကို ရှောင်ကြဉ်ပါ။,ရောဂါလက္ခဏာများ စတင်တွေ့ရှိပါက ကော့ပါးအောက်စီကလိုရိုက် (Copper oxychloride) ကဲ့သို့သော ဘက်တီးရီးယားသတ်ဆေးများကို အသုံးပြုနိုင်သည်။","120g");
        populateDisease("စပါးရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","ကျူပရောက်ဆက်","ထိသေအစွမ်းသတ္တိနှင့် အရွက်အပင်ပေါ်တွင် ပြန့်နှံ့ဖုံးအုပ်နိုင်စွမ်းအကောင်းဆုံးဆေးဖြစ်သည်။ရောဂါဖြစ်စေသော မှိုမျှင်များကိုသတ်ပြီး၊ စပိုးပွားများခြင်းမှ ကာကွယ်ပေးသည်။",3000.00,"Tri-basic Copper sulphate 345 g","pesticides/ကျူပရောက်ဆက်.jpg","ရောဂါကင်းစင်သော မျိုးစေ့ကို အသုံးပြုပါ။,စပါးပင်များ ကျပ်မနေစေရန် စိုက်ပျိုးစိပ်ခြင်းကို ရှောင်ကြဉ်ပါ။,ရောဂါလက္ခဏာများ စတင်တွေ့ရှိပါက ကော့ပါးအောက်စီကလိုရိုက် (Copper oxychloride) ကဲ့သို့သော ဘက်တီးရီးယားသတ်ဆေးများကို အသုံးပြုနိုင်သည်။","120g");


        populateDisease("Healthy","ဘတ်တီးရီးယား","","",0.00,"","","","");

    }

    public void populateDiseases(List<String> diseases){

        for(var disease: diseases){
            var diseaseEntity  = new Disease();
            diseaseEntity.setName(disease);
            diseaseEntity.setVirus("ဘတ်တီးရီးယား");
            diseaseRepository.save(diseaseEntity);
        }
    }

    public void populateDisease(
            String diseaseName, String virusName, String pesticideName, String pesticideInfo, Double pesticidePrice,
            String pesticideIngredient, String pesticideImagePath, String prevention, String pesticideWeight
    ){



        try {
            Disease disease = diseaseRepository.findDiseaseByName(diseaseName);
            Pesticide pesticide = new Pesticide();
            pesticide.setName(pesticideName);
            pesticide.setInfo(pesticideInfo);
            pesticide.setPrice(pesticidePrice);
            pesticide.setWeight(pesticideWeight);
            pesticide.setIngredients(pesticideIngredient);
            pesticide.setImagePath(pesticideImagePath);

            pesticideRepository.save(pesticide);

            if(Objects.isNull(disease.getCure())){
                Cure cure = new Cure();
                cure.setDisease(disease);
                disease.setCure(cure);
                cure.getPesticides().add(pesticide);
                cure.setPrevention(prevention);
                cureRepository.save(cure);
            }else {
                var cure = disease.getCure();
                cure.getPesticides().add(pesticide);
                var saved = cureRepository.save(cure);
            }
        }catch(Exception e){
            throw new RuntimeException("Disease finding got error." + e.getMessage());
        }


    }



    @Transactional
    public void populateRole(List<String> roles){

        var prefix = "ROLE_";
        if (!roles.isEmpty()){
            for(var role: roles) {
                var newRole = new Role();
                newRole.setName(prefix + role );
                newRole.setDescription("Role created by " + getClass().getSimpleName());
                roleRepository.save(newRole);
            }
        }
    }


    @Transactional
    public void populateAdmin(String name, String email, String password){
        var adminRole = roleRepository.findByName("ROLE_admin").get();

        var auth = new Auth();
        auth.setEmail(email);
        auth.setPassword(passwordEncoder.encode(password));
        auth.setEmailVerified(true);
        auth.setRole(adminRole);

        authRepository.save(auth);

        var admin = new Admin();
        admin.setId(auth.getId());
        admin.setName(name);
        admin.setAuth(auth);

        adminRepository.save(admin);
    }


    @Transactional
    public void populateFarmer(String name, String email, String password, String address){
        var farmerRole = roleRepository.findByName("ROLE_farmer").get();
        var auth = new Auth();
        auth.setEmail(email);
        auth.setPassword(String.format("{noop}%s", password));
        auth.setEmailVerified(true);
        auth.setRole(farmerRole);

        authRepository.save(auth);

        var farmer = new Farmer();
        farmer.setId(auth.getId());
        farmer.setAddress(address);
        farmer.setName(name);
        farmer.setAuth(auth);

        farmerRepository.save(farmer);

    }


    @Transactional
    public void populateMerchant(String name, String nrc, String email, String password, List<String> shopNames){
        var farmerRole = roleRepository.findByName("ROLE_merchant").get();
        var auth = new Auth();
        auth.setEmail(email);
        auth.setPassword(String.format("{noop}%s", password));
        auth.setEmailVerified(true);
        auth.setRole(farmerRole);

        authRepository.save(auth);

        var merchant = new Merchant();
        merchant.setId(auth.getId());
        merchant.setName(name);
        merchant.setName(nrc);

        merchantRepository.save(merchant);

        if(!shopNames.isEmpty()){
            for(var shopName: shopNames) {
                var shop = new Shop();
                shop.setMerchant(merchant);
                shop.setName(shopName);
                shop.setDescription("Owned by" + merchant.getName());
                shop.setAddress("default street");

                shopRepository.save(shop);
            }
        }


    }



}
//        populateDisease("စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","ပရိုဝမ်း","",5000.00,"","pesticides/","မျိုးစေ့ဆောင်ရောဂါဖြစ်သည့်အတွက် ရောဂါကင်းသော ခံနိုင်ရည်ရှိသော မျိုးကောင်းမျိုးသန့်များကို စိုက်ပျိုးပါ။,ရောဂါဖြစ်စေသော သက်ရှိ ခိုအောင်းနိုင်သော လက်ခံပင်များကို ရှင်းလင်းပစ်ပါ။,စိုက်ပျိုးကတည်းက မြေပြင်ကို မြေဆီလုံလောက်စွာ ပြုပြင်၍ စိုက်ပျိုးပါ။","150g");
//        populateDisease("စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","ဇီဖလို","",5000.00,"","pesticides/","မျိုးစေ့ဆောင်ရောဂါဖြစ်သည့်အတွက် ရောဂါကင်းသော ခံနိုင်ရည်ရှိသော မျိုးကောင်းမျိုးသန့်များကို စိုက်ပျိုးပါ။,ရောဂါဖြစ်စေသော သက်ရှိ ခိုအောင်းနိုင်သော လက်ခံပင်များကို ရှင်းလင်းပစ်ပါ။,စိုက်ပျိုးကတည်းက မြေပြင်ကို မြေဆီလုံလောက်စွာ ပြုပြင်၍ စိုက်ပျိုးပါ။","150g");
//        populateDisease("စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","ရီဗိုက်","",5000.00,"","pesticides/","မျိုးစေ့ဆောင်ရောဂါဖြစ်သည့်အတွက် ရောဂါကင်းသော ခံနိုင်ရည်ရှိသော မျိုးကောင်းမျိုးသန့်များကို စိုက်ပျိုးပါ။,ရောဂါဖြစ်စေသော သက်ရှိ ခိုအောင်းနိုင်သော လက်ခံပင်များကို ရှင်းလင်းပစ်ပါ။,စိုက်ပျိုးကတည်းက မြေပြင်ကို မြေဆီလုံလောက်စွာ ပြုပြင်၍ စိုက်ပျိုးပါ။","150g");
//        populateDisease("စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","ဟေဗင်","",5000.00,"","pesticides/","မျိုးစေ့ဆောင်ရောဂါဖြစ်သည့်အတွက် ရောဂါကင်းသော ခံနိုင်ရည်ရှိသော မျိုးကောင်းမျိုးသန့်များကို စိုက်ပျိုးပါ။,ရောဂါဖြစ်စေသော သက်ရှိ ခိုအောင်းနိုင်သော လက်ခံပင်များကို ရှင်းလင်းပစ်ပါ။,စိုက်ပျိုးကတည်းက မြေပြင်ကို မြေဆီလုံလောက်စွာ ပြုပြင်၍ စိုက်ပျိုးပါ။","150g");
//        populateDisease("စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","ဩဘာစပါးမှိုဆေး","",5000.00,"","pesticides/","မျိုးစေ့ဆောင်ရောဂါဖြစ်သည့်အတွက် ရောဂါကင်းသော ခံနိုင်ရည်ရှိသော မျိုးကောင်းမျိုးသန့်များကို စိုက်ပျိုးပါ။,ရောဂါဖြစ်စေသော သက်ရှိ ခိုအောင်းနိုင်သော လက်ခံပင်များကို ရှင်းလင်းပစ်ပါ။,စိုက်ပျိုးကတည်းက မြေပြင်ကို မြေဆီလုံလောက်စွာ ပြုပြင်၍ စိုက်ပျိုးပါ။","150g");
//        populateDisease("စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","ဘီလီယံ","",5000.00,"","pesticides/","မျိုးစေ့ဆောင်ရောဂါဖြစ်သည့်အတွက် ရောဂါကင်းသော ခံနိုင်ရည်ရှိသော မျိုးကောင်းမျိုးသန့်များကို စိုက်ပျိုးပါ။,ရောဂါဖြစ်စေသော သက်ရှိ ခိုအောင်းနိုင်သော လက်ခံပင်များကို ရှင်းလင်းပစ်ပါ။,စိုက်ပျိုးကတည်းက မြေပြင်ကို မြေဆီလုံလောက်စွာ ပြုပြင်၍ စိုက်ပျိုးပါ။","150g");
//        populateDisease("စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","ကာဆူဂါ","",5000.00,"","pesticides/","မျိုးစေ့ဆောင်ရောဂါဖြစ်သည့်အတွက် ရောဂါကင်းသော ခံနိုင်ရည်ရှိသော မျိုးကောင်းမျိုးသန့်များကို စိုက်ပျိုးပါ။,ရောဂါဖြစ်စေသော သက်ရှိ ခိုအောင်းနိုင်သော လက်ခံပင်များကို ရှင်းလင်းပစ်ပါ။,စိုက်ပျိုးကတည်းက မြေပြင်ကို မြေဆီလုံလောက်စွာ ပြုပြင်၍ စိုက်ပျိုးပါ။","150g");
//        populateDisease("စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","M-Pro 25% EC","",5000.00,"","pesticides/","မျိုးစေ့ဆောင်ရောဂါဖြစ်သည့်အတွက် ရောဂါကင်းသော ခံနိုင်ရည်ရှိသော မျိုးကောင်းမျိုးသန့်များကို စိုက်ပျိုးပါ။,ရောဂါဖြစ်စေသော သက်ရှိ ခိုအောင်းနိုင်သော လက်ခံပင်များကို ရှင်းလင်းပစ်ပါ။,စိုက်ပျိုးကတည်းက မြေပြင်ကို မြေဆီလုံလောက်စွာ ပြုပြင်၍ စိုက်ပျိုးပါ။","150g");
//        populateDisease("စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","ကျူပရိုမက်စ် ၈၅ ဒဗလျူပီ","",5000.00,"","pesticides/","မျိုးစေ့ဆောင်ရောဂါဖြစ်သည့်အတွက် ရောဂါကင်းသော ခံနိုင်ရည်ရှိသော မျိုးကောင်းမျိုးသန့်များကို စိုက်ပျိုးပါ။,ရောဂါဖြစ်စေသော သက်ရှိ ခိုအောင်းနိုင်သော လက်ခံပင်များကို ရှင်းလင်းပစ်ပါ။,စိုက်ပျိုးကတည်းက မြေပြင်ကို မြေဆီလုံလောက်စွာ ပြုပြင်၍ စိုက်ပျိုးပါ။","150g");
//        populateDisease("စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","ဘာလီဆိုဒ် ၅ အက်(စ်)အယ်(လ်)","",5000.00,"","pesticides/","မျိုးစေ့ဆောင်ရောဂါဖြစ်သည့်အတွက် ရောဂါကင်းသော ခံနိုင်ရည်ရှိသော မျိုးကောင်းမျိုးသန့်များကို စိုက်ပျိုးပါ။,ရောဂါဖြစ်စေသော သက်ရှိ ခိုအောင်းနိုင်သော လက်ခံပင်များကို ရှင်းလင်းပစ်ပါ။,စိုက်ပျိုးကတည်းက မြေပြင်ကို မြေဆီလုံလောက်စွာ ပြုပြင်၍ စိုက်ပျိုးပါ။","150g");
//        populateDisease("စပါးဘတ်တီးရီးယားရွက်ခြောက်ရောဂါ","ဘတ်တီးရီးယား","ဘာလီဆိုဒ် ၅ အက်(စ်)အယ်(လ်)","",5000.00,"","pesticides/","မျိုးစေ့ဆောင်ရောဂါဖြစ်သည့်အတွက် ရောဂါကင်းသော ခံနိုင်ရည်ရှိသော မျိုးကောင်းမျိုးသန့်များကို စိုက်ပျိုးပါ။,ရောဂါဖြစ်စေသော သက်ရှိ ခိုအောင်းနိုင်သော လက်ခံပင်များကို ရှင်းလင်းပစ်ပါ။,စိုက်ပျိုးကတည်းက မြေပြင်ကို မြေဆီလုံလောက်စွာ ပြုပြင်၍ စိုက်ပျိုးပါ။","150g");